app/views/users/index.html.erb

SELECT "groups".* FROM "groups" WHERE ("groups".user_id = 10) LIMIT 1
---
    <td><%=h user.email %></td>
    <td><%=h user.group %></td>