app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    @user.group = Group.find_or_create_by_name(params[:user][:group_attributes][:name])


    if @user.save_without_session_maintenance
---
INSERT INTO "groups" ("name", "updated_at", "created_at", "description") VALUES ('Monies, Inc', '2011-12-19 17:28:12.787935', '2011-12-19 17:28:12.787935', NULL)
INSERT INTO "users" ("last_login_ip", "single_access_token", "created_at", "current_login_ip", "perishable_token", "failed_login_count", "updated_at", "last_request_at", "persistence_token", "login_count", "current_login_at", "crypted_password", "password_salt", "email", "last_login_at", "name") VALUES (NULL, 'OKgYpvVlRAzGDKsKi0s2', '2011-11-02 15:32:53.699859', '127.0.0.1', '0lswsW4sdWr3HR2hX3i', 0, '2011-11-02 15:32:53.699859', '2011-11-02 15:32:53.699043', '22b78aea05cfdc5989348a0690c2dcf57ad2becc2c01941d31ef6b27c6b567ce756eda6267e180f4ed2ea373429b57ba696ea9b3f2087fa2bcfa0c7f94f16a9d', 1, '2011-11-02 15:32:53.698871', '93fe8dcbf0b59b0ac062a12d0656677b0c46cfed9810370a1889fcac3194e06fb424a0bb89ae3c662ad12890d6d34e7b1d00589afa5f93b1055a52de219c35e5', 'bvmkzzz1ePAuqJc3YERt', 'trainwreck1101@yahoo.com', NULL, 'Mike')
SELECT 1 FROM "groups" WHERE ("groups"."name" = 'Covenant') AND ("groups".id <> 2) LIMIT 1
UPDATE "groups" SET "updated_at" = '2011-12-20 23:18:29.098020', "user_id" = 14 WHERE "groups"."id" = 2
UPDATE "users" SET "updated_at" = '2011-11-09 16:58:26.177867', "perishable_token" = '3xf5xCLjpW2bf4Yhvbws' WHERE "users"."id" = 4

  def activate
    @user = User.find_using_perishable_token(params[:activation_code], 1.week)
---
SELECT "users".* FROM "users" WHERE (perishable_token = 'Z5GkKFR5Fq4KwKhOU9FR' and updated_at > '2011-11-03 17:44:01.987860') LIMIT 1

  def index
    @users = User.find(:all, :order => :name)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 10 LIMIT 1

  def update
    @user = @current_user
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "current_login_at" = '2011-11-02 15:36:19.924723', "last_login_at" = '2011-11-02 15:32:53.698871', "last_login_ip" = '127.0.0.1', "updated_at" = '2011-11-02 15:36:19.925661', "password_salt" = 'whfkMSrixTfz6ZCfDIk3', "crypted_password" = '39e5b7fb8927cf3511cd93ee1b9f59cf009732583ce9229db10779df25995212604592bac3b15168e3bbc33307f13c8b7d74d8640535d329a7ea53b92d3f9591', "last_request_at" = '2011-11-02 15:36:19.925019', "perishable_token" = 'LJImqwDYhsSzPv6Eyd9', "persistence_token" = '26cd25f324e7e8422122e69a02e929cf3cc0bc0f7a717c68591113d4342df9ce4250f9d5223d92f929c3336016e2a9f172f46490ecec8900625e6372477e21d5', "login_count" = 2 WHERE "users"."id" = 1

  def reset_password
    @user = User.find_using_perishable_token(params[:reset_password_code], 1.week)
---
SELECT "users".* FROM "users" WHERE (perishable_token = 'jI5PVO6rC7EtQhui5l2S' and updated_at > '2011-11-07 18:40:14.268154') LIMIT 1

  def reset_password_submit
    @user = User.find_using_perishable_token(params[:reset_password_code], 1.week)

    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]
    if @user.save
---
SELECT "users".* FROM "users" WHERE (perishable_token = 'dJyRiKRBAsilEzW8eWKH' and updated_at > '2011-11-07 20:02:48.509816') LIMIT 1
UPDATE "users" SET "persistence_token" = '74d3715875317b5ff8ff5a1c854251602ecb6d124f2a724cfa28ce39a7825d9692606334857e8decb1c44022bf6db28651be2cfbaa642222a01b8ba2e886bc72', "crypted_password" = '984964437024882bf545463625baa6aa2a4a07878d0a85ac5f056486ac3d866141cad21b7083e99dd2a0961eed1dd81f0d53f2f0d35c15b271dbd60547c4702b', "password_salt" = 'qbaAK3GLI4yhuhqWWqRb', "last_login_at" = '2011-11-14 19:27:39.552868', "login_count" = 7, "perishable_token" = 'e69qAsBnY7udKauqshZT', "last_request_at" = '2011-11-14 20:02:48.535204', "updated_at" = '2011-11-14 20:02:48.536135', "current_login_at" = '2011-11-14 20:02:48.534808' WHERE "users"."id" = 10